```google_iam_workload_identity_pool.test_kind_cluster: Refreshing state... [id=projects/gke-metadata-server/locations/global/workloadIdentityPools/test-kind-cluster]
google_service_account.test: Refreshing state... [id=projects/gke-metadata-server/serviceAccounts/test-sa@gke-metadata-server.iam.gserviceaccount.com]
google_storage_bucket.cluster_issuer_test: Refreshing state... [id=gke-metadata-server-issuer-test]
google_storage_bucket.test: Refreshing state... [id=gke-metadata-server-test]
google_storage_bucket_iam_member.all_users_object_viewer: Refreshing state... [id=b/gke-metadata-server-issuer-test/roles/storage.objectViewer/allUsers]
google_service_account_iam_member.openid_token_creator: Refreshing state... [id=projects/gke-metadata-server/serviceAccounts/test-sa@gke-metadata-server.iam.gserviceaccount.com/roles/iam.serviceAccountOpenIdTokenCreator/serviceAccount:test-sa@gke-metadata-server.iam.gserviceaccount.com]
google_storage_bucket_iam_member.test_service_account_bucket_object_admin: Refreshing state... [id=b/gke-metadata-server-test/roles/storage.objectAdmin/serviceAccount:test-sa@gke-metadata-server.iam.gserviceaccount.com]
google_service_account_iam_member.workload_identity_user: Refreshing state... [id=projects/gke-metadata-server/serviceAccounts/test-sa@gke-metadata-server.iam.gserviceaccount.com/roles/iam.workloadIdentityUser/principal://iam.googleapis.com/projects/637293746831/locations/global/workloadIdentityPools/test-kind-cluster/subject/system:serviceaccount:default:test]
google_iam_workload_identity_pool_provider.test: Refreshing state... [id=projects/gke-metadata-server/locations/global/workloadIdentityPools/test-kind-cluster/providers/test]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_service_account.wftest will be created
  + resource "google_service_account" "wftest" {
      + account_id = "tftest"
      + disabled   = false
      + email      = (known after apply)
      + id         = (known after apply)
      + member     = (known after apply)
      + name       = (known after apply)
      + project    = "gke-metadata-server"
      + unique_id  = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```